erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/InformationRegisters/СХК_РазмещениеОрдер/СХК_РазмещениеОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_РазмещениеОрдер</name>
  <dimensions>
    <name>ДокументОрдер</name>
    <type>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/InformationRegisters/СХК_Спайки/СХК_Спайки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_Спайки</name>
  <dimensions>
    <name>ОснНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопНомеклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Documents/СХК_СписаниеЯчейки/СХК_СписаниеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СХК_СписаниеЯчейки</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснования</name>
    <type>
      <types>DocumentRef.РасходныйОрдерНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>Собран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыПоРаспоряжениям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоКоличество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Собран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШКУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СобранныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Кладовщик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/CommonModules/СХК_ТСДСклад/Module.bsl
Функция ОстатокЯчейкаНоменклатура(Ячейка,Номенклатура,Серия,ДатаЗапроса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	|ИЗ
	|	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки(&ДатаЗапроса,Ячейка = &Ячейка И 
	|																Номенклатура = &Номенклатура И
	|																Серия = &Серия	) КАК СХК_ТоварыНаСкладеОстатки";
	
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Серия", Серия);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ВНаличииОстаток;
	Иначе
		Возврат 0 ;
	КонецЕсли;
	
КонецФункции

Функция ПоискОрдераЯчейки(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СХК_РазмещениеОрдер.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрСведений.СХК_РазмещениеОрдер КАК СХК_РазмещениеОрдер
	|ГДЕ
	|	СХК_РазмещениеОрдер.ДокументОрдер = &ДокументОрдер";
	Запрос.УстановитьПараметр("ДокументОрдер",ДокументСсылка );
	
	Рез = Запрос.Выполнить().Выгрузить();

	Возврат Рез;
		
КонецФункции 


Функция ПоискСХКСписание(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	СХК_СписаниеЯчейки.Ссылка КАК Ссылка,
	               |	СХК_СписаниеЯчейки.Собран КАК Собран
	               |ИЗ
	               |	Документ.СХК_СписаниеЯчейки КАК СХК_СписаниеЯчейки
	               |ГДЕ
	               |	СХК_СписаниеЯчейки.ДокОснования = &ДокОснования
	               |	И СХК_СписаниеЯчейки.ПометкаУдаления = &ПометкаУдаления
	               |	И СХК_СписаниеЯчейки.Проведен = &Проведен";
	Запрос.УстановитьПараметр("ДокОснования",ДокументСсылка); 
	Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);   
	Запрос.УстановитьПараметр("Проведен",Истина);   
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Собран;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Функция ПоискЯчейкиШК(ШтрихКод) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	               |	СХК_СкладЯчейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
	               |ГДЕ
	               |	СХК_СкладЯчейки.ШтрихКод = &ШтрихКод";   
	Запрос.УстановитьПараметр("ШтрихКод",ШтрихКод); 
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;		
КонецФункции

Функция СодержимоеЯчейки(Ячейка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 1
	               |	И СХК_ТоварыНаСкладеОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |	И СХК_ТоварыНаСкладеОстатки.Ячейка = &Ячейка";
	
	Запрос.УстановитьПараметр("Ячейка",Ячейка);   
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции	


Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции   


Функция Разложить(Знач Стр, Разделитель = ";") Экспорт
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Список.Добавить(Стр);
	
	Возврат Список;
	
КонецФункции



Функция ЗаполнитьУпаковкаУп(ШтрихКод,Номенклатура) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	|	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Штрихкод",ШтрихКод);
	//4630205928135
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда 
		Возврат Рез.Упаковка; 
	Иначе
		ЗапросСпаек = Новый Запрос;
		ЗапросСпаек.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СХК_Спайки.ОснНоменклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ОсновнаяНоменклатура
		|ИЗ
		|	РегистрСведений.СХК_Спайки КАК СХК_Спайки
		|ГДЕ
		|	(СХК_Спайки.ДопНомеклатура = &Номенклатура
		|			ИЛИ СХК_Спайки.ОснНоменклатура = &Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОсновнаяНоменклатура КАК ВТ_ОсновнаяНоменклатура
		|		ПО (ШтрихкодыНоменклатуры.Номенклатура = ВТ_ОсновнаяНоменклатура.Номенклатура)
		|			И (ШтрихкодыНоменклатуры.Упаковка.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.Упаковка))
		|			
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
		ЗапросСпаек.УстановитьПараметр("Номенклатура",Номенклатура);
		ЗапросСпаек.УстановитьПараметр("Штрихкод",ШтрихКод);
		РезСпаек = ЗапросСпаек.Выполнить().Выбрать();
		Если РезСпаек.Следующий() Тогда 
			Возврат РезСпаек.Упаковка; 
		КонецЕсли;		
	КонецЕсли;

КонецФункции

Функция СписаниеСклад(ДокументОснования) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СХК_СписаниеЯчейки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СХК_СписаниеЯчейки КАК СХК_СписаниеЯчейки
	               |ГДЕ
	               |	СХК_СписаниеЯчейки.ДокОснования = &ДокОснования
	               |	И СХК_СписаниеЯчейки.Проведен = ИСТИНА
	               |	И СХК_СписаниеЯчейки.ПометкаУдаления = ЛОЖЬ
	               |	И СХК_СписаниеЯчейки.Собран = ИСТИНА";
	Запрос.УстановитьПараметр("ДокОснования",ДокументОснования);
	Рез =  Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
